[
    {
        "quote": "George falls forward a bit at the intrusion, small and soft sounds of pleasure dripping from his mouth, and he feels Sapnap’s hands reach up to twist at his nipples some more. The duo stimulation makes him spin, and his fingernails dig into the hips underneath him. Sapnap hisses, returning the pain with a tug of his fingers. \"Fuck!\" George shrieks, and both the men laugh.\n\n\"Come on, baby,\" Sapnap coos, lifting George by his chin, other hand wrapping around his cock so he can tap it to pretty pink lips, \"put your mouth back to work.\"\n\nGeorge whimpers, opening up immediately and letting Sapnap push him back down on his dick. His hips jerk underneath George’s palm, and the sudden movement makes the other gag for a moment until he relaxes his throat and accepts the thrusts. ",
        "title": "take one, call it even; take two, call me selfish",
        "author": "qkittie",
        "link": "https://archiveofourown.org/works/32129569",
        "words": 10048,
        "chapter": "1/1",
        "nsfw": true
    },
    {
        "quote": "\"No,\" he says, tone demanding, yet it barely hides the desperation that wracks his bones. \"You put me in these cuffs, so I’m gonna stay in these cuffs. That was the deal, wasn’t it? That was what you wanted.\"\n\nGeorge whimpers. Dream shuts him up with a particularly deep roll of his hips.\n\n\"So deal with it, slut. Fuck yourself on my cock.\"\n\nAnd fuck, does that make George whine. He lifts himself up again, choking out a moan at the feeling of Dream inching out of him before plopping down, and Dream enjoys the sight of shaky legs and pretty tears more than he really should. The crying boy bounces on his cock weakly, his movements slow as he begs Dream to help him, but Dream doesn’t. He says still, smirking to himself, and watches George fall into submissive bliss.\n\nGeorge is crying; his eyes are red and puffy, thick lashes clumping together from dampness, and Dream finds it to be the most attractive sight he’s ever been welcomed with. And when George is yearning, gasping from barely-there prods to his prostate, Dream never wants to unsee this moment.",
        "title": "22 Wishes",
        "author": "dnfsinner",
        "link": "https://archiveofourown.org/works/33213148",
        "words": 8576,
        "chapter": "1/1",
        "nsfw": true
    },
    {
        "quote": "\"Wet them\"\n\nGeorge obediently takes them into his mouth and licks them, trying to get them as wet as possible. Clay takes his fingers out from his mouth and moves them to his rim, gently tracing as he savours the slight trembles in the smaller mans thighs.\n\n\"You look so sexy for me Georgie\" he shoves his finger in him, down to the second joint.\n\nGeorge responds with a lewd moan and starts breathing heavily.\n\nClay works the whole finger into him, soon adding another, then another until he's pumping three fingers into his best friend, drinking in every whine, gasp, moan and tremble that he produces.\n\n\"God you look like such a slut\" Clay groans out and he slowly takes his fingers out of him.",
        "title": "top.",
        "author": "VegetarianEggroll",
        "link": "https://archiveofourown.org/works/28040151",
        "words": 1921,
        "chapter": "1/1",
        "nsfw": true
    }
]