[
    {
        "quote": "\"Fuck,\" George mutters, carding a hand through tufts of blond hair. \"You look good like this.\"\n\nThe praise goes straight to Dream’s head, and he smiles as wide as he can around the intrusion in his mouth, bobbing his head as he keeps the voluptuous eye contact.\n\nGeorge breaks it, throwing his head back as Dream sinks lower and lower, hollowing out his cheeks. The hand in Dream’s hair pulls him off, a thin trail of spit connecting the two and leaving him fanning hot air on George’s dick.",
        "title": "When You're 22",
        "author": "flameonfire",
        "link": "https://archiveofourown.org/works/33194857",
        "words": 13144,
        "chapter": 1
    },
    {
        "quote": "Dream hums sadistically. \n\"Want me to fuck your pretty mouth with my fingers, angel?\"",
        "title": "Sympathy For The Devil",
        "author": "dnfsinner",
        "link": "https://archiveofourown.org/works/33406837",
        "words": 10936,
        "chapter": 1
    },
    {
        "quote": "\nHe gags, spluttering around the sudden intrusion, and the sounds make George all the more needy.\n\n\"Close,\" he says, legs trembling and fingers nearly ripping the pillow apart. \"Dream, stop, g-gonna cum.\"\n\nBut Dream doesn’t listen. He adds a third and final finger, stretching George open and moaning around the cock that's lodged at the back of his esophagus. The vibrations linger around his length, George essentially fucking Dream’s throat, and the blond knows he’s on the verge of cumming when more salty liquid lands heavy on his tongue.",
        "title": "When You’re 22",
        "author": "flameonfire",
        "link": "https://archiveofourown.org/works/33194857",
        "words": 13144,
        "chapter": 1
    },
    {
        "quote": "\n\"Th-then what do you want, birthday boy?\"\n\nHe can feel George slipping, confidence falling off him like waves as he finally gives into Dream’s demeanour, head tilting to the side to give Dream better access to his throat. Their cocks brush together when Dream leans in deeper, pulling a ruggish groan from his lips at the friction, and he immediately muffles it against George’s shoulder.\n\n\"You,\" Dream says, rolling his hips and basking in the over sensitive moans he receives in return. \"I want you, moaning my name and cumming around my cock while I split you open and give you all that you deserve.\"\n\n\"I want you as mine, and I don’t care if that sounds selfish because that’s all I’ve dreamed about since the moment I met you.\"",
        "title": "When You’re 22",
        "author": "flameonfire",
        "link": "https://archiveofourown.org/works/33194857",
        "words": 13144,
        "chapter": 1
    },
    {
        "quote": "\"Fuck,\" Dream moans, hands scrambling to find purchase on a slender waist and gripping until his fingerprints paint ivory skin crimson. George sounds absolutely fucked out already, blissful sighs breathed onto Dream’s shoulder, and he can feel the brunet’s heart thump against his chest. \"You okay?\" He asks.\n\nGeorge rises again, the tip of Dream’s cock catching on his rim before he lowers himself again, a stuttered curse leaving the man above him.\n\n\"M’fine. Y-you’re just...,\" he cries, trailing off and rolling his hips, letting Dream’s cock grind against the sensitive bundle of nerves. He swallows, the sound resonating in Dream’s ears as he aids George in his ministrations. \"Big.\"\n\nDream’s ego swells and he pulls George across his dick, makes him feel just how big he can be when he’s fucking George into oblivion. And it causes the brunet to shake his head quickly.\n\n\"N-Not so fast-fuck! Right there, Dream, please... Right there.\"",
        "title": "When You’re 22",
        "author": "flameonfire",
        "link": "https://archiveofourown.org/works/33194857",
        "words": 13144,
        "chapter": 1
    },
    {
        "quote": "\"No,\" he says, tone demanding, yet it barely hides the desperation that wracks his bones. \"You put me in these cuffs, so I’m gonna stay in these cuffs. That was the deal, wasn’t it? That was what you wanted.\"\n\nGeorge whimpers. Dream shuts him up with a particularly deep roll of his hips.\n\n\"So deal with it, slut. Fuck yourself on my cock.\"\n\nAnd fuck, does that make George whine. He lifts himself up again, choking out a moan at the feeling of Dream inching out of him before plopping down, and Dream enjoys the sight of shaky legs and pretty tears more than he really should. The crying boy bounces on his cock weakly, his movements slow as he begs Dream to help him, but Dream doesn’t. He says still, smirking to himself, and watches George fall into submissive bliss.\n\nGeorge is crying; his eyes are red and puffy, thick lashes clumping together from dampness, and Dream finds it to be the most attractive sight he’s ever been welcomed with. And when George is yearning, gasping from barely-there prods to his prostate, Dream never wants to unsee this moment.",
        "title": "22 Wishes",
        "author": "dnfsinner",
        "link": "https://archiveofourown.org/works/33213148",
        "words": 8576,
        "chapter": 1
    }
]